---
kind: enumMember
id: F:Autodesk.Revit.DB.Analysis.ConstructionType.Roof
enum: Autodesk.Revit.DB.Analysis.ConstructionType
zh: 屋顶
source: html/5f6be035-3a2d-77ad-8402-4d6b87dec818.htm
---
# Autodesk.Revit.DB.Analysis.ConstructionType.Roof

**中文**: 屋顶

A roof over the space